IDEA StatiCa Open Model
CrossSectionFactory.FillWeldedU Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fill steel section of channel shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillWeldedU(
	CrossSectionParameter cssO,
	double b,
	double hw,
	double tw,
	double tf,
	double rw,
	double rf,
	double taperF
)
Public Shared Sub FillWeldedU (
	cssO As CrossSectionParameter,
	b As Double,
	hw As Double,
	tw As Double,
	tf As Double,
	rw As Double,
	rf As Double,
	taperF As Double
)
public:
static void FillWeldedU(
	CrossSectionParameter^ cssO,
	double b,
	double hw,
	double tw,
	double tf,
	double rw,
	double rf,
	double taperF
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b
Type: System.Double
width
hw
Type: System.Double
depth
tw
Type: System.Double
web thickness
tf
Type: System.Double
flange thickness
rw
Type: System.Double
root radius
rf
Type: System.Double
flange edge rounding radius
taperF
Type: System.Double
Flange taper
Return Value
Type:
Remarks
Dimension of channel section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 3;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double b = 0.2;
double hw = 0.4;
double tw = 0.025;
double tf= 0.02;
double rw= 0.004;
double rf = 0.002;
double taperF = 0.001;
CrossSectionFactory.FillWeldedU(css, b, hw, tw, tf, rw, rf, taperF);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace